#+STARTUP: content
#+PROPERTY: HEADER-ARGS+ :eval yes :exports both
#+TITLE: Regions with pending contents
#+AUTHOR: Bruno BARBIER
#+DATE: 2024-03-18
** Test
Check the following elisp instructions. The 2 last lines are
mandatory.  Feel free to remove the first ones.  Then, execute the
block to load the code required for the demo.
   #+begin_src elisp :results silent :exports code :eval no-export
   (setq-local org-confirm-babel-evaluate nil)
   ;; (setq debug-on-error nil)
   (load-file "my-elib-async.el")
   (load-file "my-async-tests.el")
   #+end_src


Here is the versions of Emacs and org that I'm using, in case it
matters:
   #+begin_src elisp
   (mapcar (lambda (sb) (list sb (symbol-value sb)))
           '(emacs-version org-version))
   #+end_src

   #+RESULTS:
   | emacs-version | 30.0.50 |
   | org-version   | 9.7-pre |

**** Example with :stdin, :cmdline and :tangle

    #+name: their-os
    Linux


    #+begin_src bash :results output :stdin their-os :cmdline RMS

      # call as ./ask_for_os.sh NAME, where NAME is who to ask

      if [ -z "$1" ]; then
          asked="$USER"
      else
          asked="$1"
      fi

      echo Hi, "$asked"! What operating system are you using?
      read my_os

      if [ "$asked" = "RMS" ]; then
          echo You\'re using GNU/"$my_os"!
      elif [ "$asked" = "Linus" ]; then
          echo You\'re using "$my_os"!
      else
          echo You\'re using `uname -o`!
      fi
    #+end_src

    #+RESULTS:
    : Hi, RMS! What operating system are you using?
    : You're using GNU/Linux!


**** With variables

    #+begin_src bash :results output :var arr='("apple" "banana" "cherry")
      echo The first element is...
      echo \"${arr[1]}\"
    #+end_src

    #+RESULTS:
    : The first element is...
    : "banana"


**** With a named element as :stdin

    #+name: my-org-element
    This is something referenced as stdin.
    The stdin can even be multiple lines!

    #+begin_src bash :stdin my-org-element :results output :session none
    cat
    #+end_src

    #+RESULTS:
    :     This is something referenced as stdin.
    :     The stdin can even be multiple lines!





***** async with a session
A very simple test:
    #+begin_src python
      2+3
    #+end_src

    #+RESULTS:
    : 5

Let's import the module time in our session.
    #+begin_src python :results silent
      import time
    #+end_src


A table that requires some time to compute:
    #+begin_src python
      start = time.time()
      time.sleep(1)
      end = time.time()
      ["%.1fs" % t for t in [start, end, end-start]]
    #+end_src



An error (click on the error , <mouse-1>, to see the details):
    #+begin_src python
      2/0
    #+end_src

    #+RESULTS:


***** async with no session
   :PROPERTIES:
    :header-args:python+: :session none
   :END:

A very simple test:
    #+begin_src python
      2+3
    #+end_src

    #+RESULTS:
    : 5

Let's import the module time in our session.
    #+begin_src python :results silent
      import time
    #+end_src



A table that requires some time to compute:
    #+begin_src python
      start = time.time()
      time.sleep(1)
      end = time.time()
      ["%.1fs" % t for t in [start, end, end-start]]
    #+end_src



Yes, it failed, as expected. "import time" was done in its own
temporary session.  The old result is preserved; the error is display
as an overlay. Click on it to get more info about the error.


Let's fix it, adding the import line:
    #+begin_src python
    import time
    start = time.time()
    time.sleep(1)
    end = time.time()
    ["%.1fs" % t for t in [start, end, end-start]]
    #+end_src



An error (click on the error , <mouse-1>, to see the details):
    #+begin_src python
      2/0
    #+end_src


**** Several bocks targetting the same result
    #+name: foo
    #+begin_src python :nasync yes :return block_name
    import time; time.sleep(3)
    block_name="block 1"
    #+end_src

    #+results: foo
    : block 2

    Another code block with the same name will write results under
    #+results: foo
    #+name: foo
    #+begin_src python :nasync yes :return block_name
    import time; time.sleep(0)
    block_name="block 2"
    #+end_src

** Running elisp in threads
   :PROPERTIES:
    :header-args:elisp:  :execute-with my-use-threads :nasync yes
   :END:

In this section, source codes must be elisp code.  They are executed
asynchronously using threads.  You need an Emacs compiled with
threads.

   #+begin_src elisp :execute-with none :nasync no :results value
   (list "threads?" (if (fboundp 'make-thread) "Yes" "No"))
   #+end_src



Simple check:
   #+begin_src elisp
   (+ 3 4)
   #+end_src



Let see with a more complex task:
   #+begin_src elisp
   (progn (sleep-for 1) (+ 3 4))
   #+end_src



Ready to wait 10s ?  Not that you can execute the following block, or
any other one during these 10s.
   #+begin_src elisp
   (dolist (n (number-sequence 0 10))
     (message "Running step %d" n)
     (sleep-for 1))
   #+end_src


Let's check an execution that fails:
   #+begin_src elisp
   (sleep-for 1)
   (error "On purpose")
   #+end_src


Synchronous multithreading ? ... why not !

   #+begin_src elisp :nasync no
   (progn (sleep-for 2) (+ 3 3))
   #+end_src

   #+RESULTS:
   : 6

Note I am in no way advising to use threads, just checking that
'org-pending' works for them too.

** Using org-async-call
   :PROPERTIES:
    :header-args:  :execute-with my-async-call :nasync yes
   :END:

In this section, we use custom backend =my-async-call= that uses
`org-async-call' and `org-async-wait-for' to execute each block using
a different process for each one.

This requires to merge the 'dev' branch from:
     https://code.tecosaur.net/tec/org-mode


   #+begin_src shell
   date
   #+end_src

   #+RESULTS:
   : Thu Feb 22 18:36:09 CET 2024


   #+begin_src shell
   sleep 1
   #+end_src

   #+RESULTS:

   #+begin_src shell
   false
   #+end_src

   #+RESULTS:


   #+begin_src shell
   oops
   #+end_src

   #+RESULTS:


   #+begin_src python :results append
   import time; time.sleep(2)
   import sys; print([sys.version, time.time()])
   #+end_src

   #+RESULTS:
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878957.5800645]
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878961.1794374]
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878964.0685596]


   #+begin_src python :results prepend
   import time; time.sleep(2)
   import sys; print([sys.version, time.time()])
   #+end_src

   #+RESULTS:
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878997.03655]
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878994.0566769]
   : ['3.11.7 (main, Jan 31 2024, 12:32:36) [GCC 13.2.1 20230826]', 1708878991.1641896]

   #+begin_src shell
   sleep 1 && date
   #+end_src

   #+RESULTS:
   : Sun Feb 25 17:38:08 CET 2024


For async-call, synchronous execution is not implemented.
   #+begin_src shell :nasync no
   sleep 1 && date
   #+end_src

   #+RESULTS:


